In [2]:
import pandas as pd

sr = pd.Series([17000,18000,1000,5000]
              , index=["피자","치킨","콜라","맥주"])
print('시리즈 출력 : ')
print('-'*15)
print(sr)

시리즈 출력 :
---------------
피자    17000
치킨    18000
콜라     1000
맥주     5000
dtype: int64

In [3]:
data = {
    '학번' : ['1000', '1001', '1002', '1003', '1004', '1005'],
    '이름' : [ 'Steve', 'James', 'Doyeon', 'Jane', 'Pilwoong', 'Tony'],
    '점수': [90.72, 78.09, 98.43, 64.19, 81.30, 99.14]
    }

df = pd.DataFrame(data)
print(df)

     학번        이름     점수
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [7]:
df.head()

     학번        이름     점수
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30

In [8]:
print(df['학번'])

0    1000
1    1001
2    1002
3    1003
4    1004
5    1005
Name: 학번, dtype: object

In [21]:
df.iloc[:,0:2]

     학번        이름
0  1000     Steve
1  1001     James
2  1002    Doyeon
3  1003      Jane
4  1004  Pilwoong
5  1005      Tony

In [22]:
import numpy as np

In [25]:
vec = np.array([1,2,3,4,5])
print(vec)

[1 2 3 4 5]

In [26]:
random_mat = np.random.random((2,2)) # 임의의 값으로 채워진 배열 생성
print(random_mat)

[[0.08813304 0.72714711]
 [0.42452597 0.73305499]]

In [29]:
test = np.array(np.arange(30).reshape((5,6)))
print(test)

[[ 0  1  2  3  4  5]
 [ 6  7  8  9 10 11]
 [12 13 14 15 16 17]
 [18 19 20 21 22 23]
 [24 25 26 27 28 29]]

In [31]:
test_mat = test[0, :]
print(test_mat)

[0 1 2 3 4 5]